alert('Если нестрогое равенство то null == 0 вернет');
alert( null == 0 );
alert('Если сравнение null > 0 то вернет ');
alert( null > 0 );
alert('Если сравнение  null >= 0 вернет ');
alert(null >= 0);
alert('Если сравнение  null == undefined вернет ');
alert(null == undefined);
alert('Все потому что undefined и null обрабатываются особым образом и равны друг другу и не равны ничему другому. Прописано в спецификации языка: http://es5.javascript.ru/x9.html#x9 . Алгоритмы проверки равенства == и сравнения >= > < <= работают по-разному. При преобразовании в число null становится 0, а undefined становится NaN')