var a = 1, b = 1, c, d;
alert('var a = 1, b = 1, c, d;')
c = ++a; alert(c + " - инкрементирование производится сразу, а возврат — уже с обновленным значением на +2. А = 2");
d = b++; alert(d + " - сначала происходит возвращение значения, а потом выполняется инкрементирование на +1. В = 2 после присвоения 1 к D");
c = (2+ ++a); alert(c + " - сначала А инкрементируется на 1 , а затем число 2 прибавляется к новому А, которое равно 3");
d = (2+ b++); alert(d + " - число 2 прибавляется к В, которое равно 2 после предыдущей операции. Увеличение на 1 числа В происходит после");
alert(a + " - в итоге А  = 3 после пердыдущих операций и А инкрементировалось сразу");
alert(b + " - в итоге В = 3 после предыдущих операций и В инкрементировалось после");

a = 2;
var x = 1 + (a *= 2);
alert(" x = " + x + " - выполняется сначала операция по формуле a = a*2 = 4, затем прибавляется к 1");